Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའ་གང་གཱའི་ཀླུང་བཅུའི་བྱེ་མ་སྙེད་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ།
en: As the light rays reached him, as many bodhisattvas as there are grains of sand in ten Ganges rivers surrounded and followed him in honor.

source: འཁོར་གྱི་ཁྱམས་རིན་པོ་ཆེ་བཀོད་པར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་ནས། དེས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: Once they had approached the Blessed One inside the pavilion Jeweled Array, they prostrated at his feet.

source: བཅོམ་ལྡན་འདས་ལ་ལན་ཁྲི་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱེད་ཅིང་རིན་པོ་ཆེའི་དྲ་བས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བཀབ་སྟེ།
en: They circumambulated him ten thousand times and in worship draped the Blessed One with filigrees of jewels.

source: སྤུ་ཡིས་མཐའ་དབུང་མ་མཆིས་པ་ཡི་ཞིང་འཛིན་ཀྱང་། །སེམས་ཅན་རྣམས་ལ་མི་གནོད་ཞིང་ལ་མི་གནོད་པས། །
en: “Although each of your bodily hairs contains boundless buddhafields, Neither the beings nor the fields themselves are compressed.

source: མིག་མེད་རྣམས་ཀྱིས་རྒྱལ་བའི་སྤྱོད་ཡུལ་འཚལ་བར་དཀའ། །
en: Hence those without eyes to see find it difficult to fathom the domain of the Victor.

source: སངས་རྒྱས་སྲས་ནི་རྒྱལ་བའི་བྱིན་གྱིས་ཡང་དག་འཚལ། །
en: The children of the Buddha know it correctly through the benevolence of the Victor.

source: ཞིང་གཅིག་ཕྱོགས་ལ་ཞིང་མང་རབ་འབྱམ་སྟོན་མཛད་དེ། །
en: “The Buddha demonstrates a multiplicity of fields in the space of a single field.

source: ཀུན་ཏུ་བསྟན་ཀྱང་རྣམ་པར་འཕེལ་དང་འགྲིབ་མ་མཆིས། །
en: Although he displays this, there is neither increase nor decrease.

source: བསམ་པ་ཆེན་པོ་དག་ལྡན་ཅི་འདྲར་གྱུར་དེ་ལ། །
en: To those who are suited to it and whose intentions are great,

source: དཔག་མེད་རྫུ་འཕྲུལ་རྣམ་པར་སྤྲུལ་པས་དེ་སྟོན་ཏོ། །
en: He demonstrates it through the display of his vast miraculous powers.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་བསྟོད་པ་ཚད་མེད་པ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་ནས་ཤར་དང་ལྷོའི་ཕྱོགས་མཚམས་ལོགས་སུ་གནས་ཏེ། རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་སྤྲུལ་པའི་རང་རང་གི་སྟན་དག་ལ་འཁོད་དོ། །
en: Once the bodhisattvas had praised the Blessed One with countless bodhisattva eulogies, they withdrew to the southeastern area of the pavilion and sat down upon seats created by their own miraculous power.

source: དེ་ནས་ལྷོ་དང་ནུབ་ཀྱི་མཚམས་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་ཐུགས་རྗེ་ཆེན་པོས་སེམས་ཅན་ཐམས་ཅད་ལ་གཟིགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་མིག་བཟང་པོ་ན། བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་ཆེན་པོ་སེམས་པ་ཞེས་བྱ་བ་
en: Then the light rays invited the bodhisattva Mind of Great Compassion to come. He resided in a buddhafield situated it the southwest, called Virtuous Eye, of the Tathāgata Gazing at All Beings with Great Compassion.

source: འོད་དེས་བསྐུལ་མ་ཐག་ཏུ། བྱང་ཆུབ་སེམས་དཔའ་གང་གཱའི་ཀླུང་བཅུའི་བྱེ་མ་སྙེད་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ།
en: As the light rays reached him, as many bodhisattvas as there are grains of sand in ten Ganges rivers surrounded and followed him in honor.

source: བཅོམ་ལྡན་འདས་ལ་ལན་ཁྲི་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱེད་ཅིང་ན་བཟའི་དྲ་བས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བཀབ་སྟེ།
en: They circumambulated him ten thousand times and in worship draped the Blessed One with filigrees of fine robes.

source: སེམས་ཅན་དམ་པ་གཡག་རྔ་ཐོགས་པ་ཇི་བཞིན་དུ། །
en: “Just like a noble person who uses a flywhisk to chase away flies,

source: ཚུལ་ཁྲིམས་དྲི་མེད་ནོར་བུ་རིན་ཆེན་འདྲ་བ་སྲུང་། །
en: The Buddha protects his stainless moral conduct as if it were a valuable jewel.

source: ཚུལ་ཁྲིམས་མེད་གཟིགས་མགོན་པོ་ཤིན་ཏུ་ཐུགས་རྗེ་ཞིང་། །
en: When the protector gazes at those without moral conduct, he feels compassion.

source: བདག་ལ་བསྟོད་པ་མི་མཛད་གཞན་ལ་སྨོད་མི་མཛད། །
en: He neither praises himself nor denigrates others.

source: ལྷུན་པོ་ཇི་བཞིན་ཁྱོད་བརྟན་བླ་མ་རྒྱ་ཆེན་སྟེན། །
en: “Like Meru, you are a stable, weighty, and vast support.

source: ཆུ་གཏེར་ཟབ་མོ་བཞིན་དུ་ཤིན་ཏུ་གཏིང་དཔག་དཀའ། །
en: Like the depths of the ocean, you are exceedingly difficult to fathom.

source: སྲིད་པ་ཐོག་མར་བཅིངས་པ་ཀུན་ནས་གྲོལ་བ་སྟེ། །
en: You have cast aside the primeval fetters of existence.

source: སེམས་ཅན་ཁྲག་ཁྲིག་ཉེས་པ་ཆེན་པོས་བཅིངས་ལས་གྲོལ། །
en: You have liberated multitudes of beings from the fetters brought about by great flaws.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་བསྟོད་པ་ཚད་མེད་པ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་ནས་ལྷོ་དང་ནུབ་ཀྱི་མཚམས་ཕྱོགས་ལོགས་སུ་གནས་ཏེ། རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་སྤྲུལ་པའི་རང་རང་གི་སྟན་དག་ལ་འཁོད་དོ། །
en: Once the bodhisattvas had praised the Blessed One with countless bodhisattva eulogies, they withdrew to the southwestern area of the pavilion and sat down upon seats created by their own miraculous power.

source: དེ་ནས་ནུབ་དང་བྱང་གི་མཚམས་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་འོད་བཀོད་པའི་རྒྱལ་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་མུན་པ་དང་བྲལ་བ་ན། བྱང་ཆུབ་སེམས་དཔའ་འོད་ཟེར་དྲ་བ་ཅན་ཞེས་བྱ་བ་འོད་དེས་བསྐུལ་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་གང་གཱའི་ཀླུང་བཅུའི་བྱེ་མ་སྙེད་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ།
en: Then the light rays invited the bodhisattva Light-Web Bearer to come. He resided in a buddhafield situated in the northwest, called Free of Darkness, of the Tathāgata Sovereign Light Display. As the light rays reached him, as many bodhisattvas as there are grains of sand in ten Ganges rivers surrounded and followed him in honor.

source: བཅོམ་ལྡན་འདས་ལ་ལན་ཁྲི་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱེད་ཅིང་རྒྱན་གྱི་དྲ་བས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བཀབ་སྟེ།
en: They circumambulated him ten thousand times and in worship draped the Blessed One with filigrees of ornaments.

source: སྲིད་པའི་རང་བཞིན་སྒྱུ་མའི་རང་བཞིན་རྟོགས་མཛད་ནས། །
en: “Because you understand the nature of existence to be the nature of a mirage,

source: བྱེད་པ་སྒྱུ་མ་ལྟ་བུ་དངོས་པོ་མེད་པར་སྟོན། །
en: You reveal that actions are like illusions and lack substance.

source: སྒྱུ་མ་ལྟ་བུ་སེམས་ཅན་ཁམས་ནི་འདུལ་མཛད་ཀྱང་། །
en: Even though you train the domains of beings, which are like a mirage,

source: འདི་ན་སེམས་ཅན་རང་བཞིན་མ་མཆིས་ཁམས་མ་མཆིས། །
en: Neither the domains nor the sentient beings exist for you.

source: དཔེར་ན་མི་ཞིག་གཉིད་ཀྱིས་ལོག་པའི་རྨི་ལམ་ན། །
en: “To give an analogy, in the dream of a sleeping person

source: གཟུགས་མཐོང་ཡང་དག་འདུ་ཤེས་དེ་བཞིན་མཐོང་མ་ལགས། །
en: The perception that sees form is not true seeing.

source: འདུས་བྱས་དངོས་པོ་མ་མཆིས་རྨི་ལམ་འདྲ་བར་གསུང་། །
en: You teach that conditioned things lack substance, like a dream.

source: ཆོས་རྣམ་སྣང་ཡང་འདི་ན་ཆོས་ལ་ཆགས་མ་མཆིས། །
en: Even though phenomena manifest, they do not come into being.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་བསྟོད་པ་ཚད་མེད་པ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་ནས། ནུབ་དང་བྱང་གི་མཚམས་ཕྱོགས་ལོགས་སུ་གནས་ཏེ། རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་སྤྲུལ་པའི་རང་རང་གི་སྟན་དག་ལ་འཁོད་དོ། །
en: Once the bodhisattvas had praised the Blessed One with countless bodhisattva eulogies, they withdrew to the northwestern area of the pavilion and sat down upon seats created by their own miraculous power.

source: དེ་ནས་བྱང་དང་ཤར་གྱི་མཚམས་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་ནམ་མཁའི་དཀྱིལ་དྲི་མ་མེད་པ་རྣམ་པར་སེམས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་དག་དྲི་མ་མེད་པར་རབ་ཏུ་གནས་པ་ན། བྱང་ཆུབ་སེམས་དཔའ་བློ་མཐའ་ཡས་དྲི་མེད་ཅེས་བྱ་བ་
en: Then the light rays invited the bodhisattva Immaculate Limitless Intelligence to come. He resided in a buddhafield situated in the northeast, called Pure Immaculate Dwelling, of the Tathāgata Immaculate Center of the Sky.

source: ལྷན་ཅིག་ཏུ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་མི་སྣང་བར་གྱུར་ནས། སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་ཕྱིན་ཏེ།
en: They all left that buddhafield together and arrived in an instant in this world system of Endurance.

source: བཅོམ་ལྡན་འདས་ལ་ལན་ཁྲི་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱེད་ཅིང་རྟག་ཏུ་སྒྲ་འབྱུང་བའི་སིལ་སྙན་གྱི་དྲ་བས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བཀབ་སྟེ།
en: They circumambulated him ten thousand times and in worship draped the Blessed One with filigrees of continuously sounding cymbals.

source: ཟབ་མོའི་ཆོས་ལ་མཁས་ཤིང་རབ་ཏུ་ཞི་ལ་མོས། །
en: “Skilled in profound Dharma and intent on peace,

source: ཁྱོད་ཀྱིས་ཆོས་ཀུན་སྟོང་ཞིང་མཚན་མ་མེད་པར་མཁྱེན། །
en: You know all phenomena to be empty and without conceptual signs.

source: ཁྱོད་ཀྱི་ཐུགས་ཀྱི་དགོངས་པ་འཇིག་རྟེན་ཀུན་མ་འཚལ། །
en: No one in the world can discern the intent of your mind;

source: མཐའ་ཡས་བློ་མངའ་སེམས་ཀྱི་བསམ་པ་ཆོ་ག་མཁྱེན། །
en: With vast intelligence, you understand the mind’s thought processes.

source: སེམས་ཅན་གཅིག་གི་སྤྱོད་བཞིན་སེམས་ཅན་ཀུན་གྱི་སྤྱོད། །
en: “Just as you know the behavior of one being,

source: གང་དག་དུས་གསུམ་ལྡན་པ་དེ་དག་ཁྱོད་ཀྱིས་མཁྱེན། །
en: You know the behaviors of all beings within the three times.

source: སེམས་ཅན་འདུ་ཤེས་མི་འཇུག་སེམས་ཀྱི་འདུ་ཤེས་མུན། །
en: Without entertaining the notion of a being, you have mastered the full knowledge

source: འདུ་ཤེས་ཡོངས་ཤེས་མཁས་ཤིང་མཉམ་པ་ཉིད་དང་ལྡན། །
en: Of the perceptions of those whose mental perception is obscured.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་བསྟོད་པ་ཚད་མེད་པ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་ནས་བྱང་དང་ཤར་གྱི་ཕྱོགས་མཚམས་ལོགས་སུ་གནས་ཏེ། རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་སྤྲུལ་པའི་རང་རང་གི་སྟན་དག་ལ་འཁོད་དོ། །
en: Once the bodhisattvas had praised the Blessed One with countless bodhisattva eulogies, they withdrew to the northeastern area of the pavilion and sat down upon seats created by their own miraculous power.

source: དེ་ནས་འོག་གི་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཨུཏྤ་ལ་དམར་པོའི་དཔལ་གྱི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་སྣང་བྱེད་དུ་སྣང་བ་ན། བྱང་ཆུབ་སེམས་དཔའ་སྤོབས་པའི་རྒྱན་བཀོད་པ་ཞེས་བྱ་བ་
en: Then the light rays invited the bodhisattva Ornamental Display of Courage to come. He resided in a buddhafield situated in the nadir, called Appearing as Illumination, of the Tathāgata Glory of the Precious Red Lotus.

source: བཅོམ་ལྡན་འདས་ལ་ལན་ཁྲི་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱེད་ཅིང་ནོར་བུ་རིན་པོ་ཆེའི་གླིང་གི་ཕྲེང་གི་དྲ་བས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བཀབ་སྟེ།
en: They circumambulated him ten thousand times and in worship draped the Blessed One with filigrees of garlands from the isle of precious jewels.

source: གལ་ཏེ་ཁྲག་ཁྲིག་ཞིང་ན་ཇི་སྙེད་རྡུལ་མཆིས་པ། །
en: “As many atoms as there are in the multitude of buddhafields,

source: དེ་སྙེད་བདེ་གཤེགས་སྲས་པོ་རྒྱལ་བའི་དྲུང་ལྷགས་ཏེ། །
en: That many children of the tathāgatas have come together in front of the Victor.

source: བསྐལ་པ་བྱེ་བ་སྟོང་མང་ཞུ་བ་ཞུས་པ་དག །
en: With a single timely reply, he answers all the questions they pose

source: དེ་དག་ཐམས་ཅད་ཚིག་གཅིག་དུས་ཀྱིས་གོ་བར་མཛད། །
en: In the course of millions of eons.

source: བློ་ལ་མཁས་པ་རབ་རྫོགས་ཤེས་རབ་ཤིན་ཏུ་རྫོགས། །
en: “You have accomplished intellectual skills and wisdom.

source: གཟུངས་དང་ཏིང་འཛིན་རབ་རྫོགས་བསོད་ནམས་མཐའ་ཡས་ཏེ། །
en: Your retention, perfect absorption, and merit are vast.

source: བསྐལ་པ་མང་པོ་མཐའ་ཡས་བསྔགས་པ་རབ་བརྗོད་ཀྱང་། །
en: Even if we were to articulate eulogies for a vast number of eons,

source: སྐྲ་རྩེས་རྒྱ་མཚོ་ཇི་བཞིན་ཟད་པར་མི་ནུས་སོ། །
en: They would be insufficient, just as the tip of a hair cannot hold an ocean.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་བསྟོད་པ་ཚད་མེད་པ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་ནས་འོག་གི་ཕྱོགས་ལོགས་སུ་གནས་ཏེ། རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་སྤྲུལ་པའི་རང་རང་གི་སྟན་དག་ལ་འཁོད་དོ། །
en: Once the bodhisattvas had praised the Blessed One with countless bodhisattva eulogies, they withdrew to the lower part of the pavilion and sat down upon seats created by their own miraculous power.

source: དེ་ནས་སྟེང་གི་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་སྒྲ་བསྒྲགས་མཆོག་གི་རྒྱལ་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་རྒྱན་གྱིས་བརྒྱན་པ་ན། བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་
en: Then the light rays invited the bodhisattva Sovereign Who Emanates All Phenomena to come. He resided in a buddhafield situated in the zenith, called Adorned by Ornaments, of the Tathāgata Sovereign of Supreme Reverberating Sound.

source: བཅོམ་ལྡན་འདས་ལ་ལན་ཁྲི་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱེད་ཅིང་རྒྱན་ཐམས་ཅད་བཀོད་པ་དང་། རིན་པོ་ཆེའི་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བཀབ་སྟེ།
en: They circumambulated him ten thousand times and in worship draped the Blessed One with filigrees of all kinds of ornaments, precious bells, and tinkling bells.

source: བདེ་གཤེགས་སྐུ་ཡི་འཕྲིན་ལས་མཐའ་དང་དབུང་མ་མཆིས། །
en: “The physical activity of the Sugata defies measure.

source: བླ་མེད་རྣམས་ཀྱི་གསུང་ཐུགས་སྤྱོད་ཡུལ་མཐའ་ཡས་པ། །
en: The speech, mind, and conduct of the unsurpassed ones are limitless.

source: དེ་ནི་སངས་རྒྱས་མཁྱེན་གྱི་སེམས་ཅན་གཞན་གྱིས་མིན། །
en: The Buddha knows that, but other beings do not,

source: དཔེར་ན་ནམ་མཁའི་མཐའ་མ་སྐྱེ་བོས་མི་རྙེད་བཞིན། །
en: Just as ordinary beings cannot grasp the limits of space.

source: མཚུངས་མེད་སྤྱོད་པ་མཐའ་དབུང་མེད་པ་ཇི་བཞིན་དུ། །
en: “Just as the conduct of the incomparable one defies measure,

source: བྱང་ཆུབ་འཁོར་ལོ་དེ་བཞིན་འོན་ཏེ་མྱ་ངན་འདས། །
en: So the wheel of awakening is nothing but nirvāṇa.

source: ས་བོན་ཇི་བཞིན་དེ་ལྟར་འབྲས་བུ་འབྱུང་བ་ལྟར། །
en: Just as fruits emerge according to the seeds sown,

source: དེ་བཞིན་ཕྱོགས་བཅུར་རྒྱལ་བའི་གནས་ཀྱང་ཚད་མ་མཆིས། །
en: So the state of the Victor knows no bounds anywhere in the ten directions.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་བསྟོད་པ་ཚད་མེད་པ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་ནས་སྟེང་གི་བར་སྣང་ལ་དོང་སྟེ། རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་སྤྲུལ་པའི་རང་རང་གི་སྟན་དག་ལ་འཁོད་དོ། །
en: Once the bodhisattvas had praised the Blessed One with countless bodhisattva eulogies, they withdrew into the space above the pavilion and sat down upon seats created by their own miraculous power.

source: དེ་ལྟར་ཕྱོགས་བཅུ་དག་ནས་བྱང་ཆུབ་སེམས་དཔའ་བཅུ་འདུས་པ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཚད་མེད་པ་དག་འོད་དེས་བསྐུལ་མ་ཐག་ཏུ་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་ཕྱིན་ཏེའཁོར་གྱི་ཁྱམས་རིན་པོ་ཆེ་བཀོད་པར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་དོ། །
en: Thus the light rays invited the ten bodhisattvas of the ten directions, together with their entourages of countless other bodhisattvas. They arrived in an instant in this world system of Endurance, and they sat before the Blessed One within the pavilion Jeweled Array.

source: དེ་ནས་བཅོམ་ལྡན་འདས་དྲན་པ་དང་ལྡན་ཞིང་མཁྱེན་བཞིན་དུ་ཏིང་ངེ་འཛིན་དེ་ལས་བཞེངས་ཏེ། གསུང་བསལ་བའི་སྒྲ་མཛད་ནས། གསུང་བསལ་བའི་སྒྲ་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དབྱངས་ཀྱིས་གོ་བར་གྱུར་ཏེ།
en: As the Blessed One mindfully and deliberately rose from that absorption, he cleared his throat and produced a sound, a melodious sound heard throughout the entire trichiliocosm.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་གང་དག་དད་པ་དང་ལྡན་ཞིང་སྣོད་དུ་གྱུར་པའི་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་དང་། མི་དང་མི་མ་ཡིན་པ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་གསུང་བསལ་བའི་སྒྲ་དེ་ཐོས་ནས་ལུས་དང་། སེམས་ཚིམ་པར་གྱུར་ཏེ
en: Once all the faithful in the entire trichiliocosm, including the monks and nuns, the laymen and laywomen, and the humans and nonhumans, heard the sound of the Blessed One clearing his throat, they grew satisfied in body and mind.

source: སངས་རྒྱས་ཀྱི་མཐུས་ཇི་ལྟར་བྱུང་བའི་ཐེམ་སྐས་དག་ནས་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་འཁོར་གྱི་ཁྱམས་རིན་པོ་ཆེ་བཀོད་པར་ཕྱིན་ཏེ།
en: By the power of the Buddha, they also arrived at the pavilion Jeweled Array in an instant, that very moment, by means of the miraculously manifesting staircases.

source: དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཕྱོགས་གཅིག་ཏུ་ཇི་ལྟར་འཐུན་པའི་སྟན་དག་ལ་འཁོད་དོ། །
en: They prostrated at the Blessed One’s feet and took their designated seats off to the side.

source: གསུང་བསལ་བའི་སྒྲ་དེ་ཉིད་ཀྱིས་ཚངས་པའི་ལྷ་རྣམས་དང་། ཚངས་རིས་དང་། ཚངས་པའི་མདུན་ན་འདོན་དང་། ཚངས་འཁོར་དང་། ཚངས་ཆེན་དང་། འོད་ཆེན་དང་། འོད་ཆུང་དང་། ཚད་མེད་འོད་དང་། འོད་གསལ་དང་། དགེ་ཆུང་དང་། ཚད་མེད་དགེ་དང་། དགེ་རྒྱས་དང་། སྤྲིན་མེད་དང་། བསོད་ནམས་སྐྱེས་དང་། འབྲས་བུ་ཆེ་བ་དང་། འདུ་ཤེས་མེད་པའི་སེམས་ཅན་དང་། མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་། གྱ་ནོམ་སྣང་དང་། ཤིན་ཏུ་མཐོང་དང་། འོག་མིན་གྱི་ལྷ་རྣམས་ཀྱང་བསྐུལ་ནས་
en: The sound of the Blessed One clearing his throat also inspired the gods of the following realms: Brahmā, Brahmakāyika, Brahma­purohita, Brahma­pariṣadya, and Mahābrahmā; Mahāprabha, Parīttābha, Apramāṇābha, and Ābhāsvara; Parīttaśubha, Apramāṇaśubha, and Śubhakṛtsna; and Anabhraka, Puṇyaprasava, Bṛhatphala, Asaṃjñisattva, Avṛha, Atapa, Sudṛśa, Sudarśana, and Akaniṣṭha.

source: སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་འཁོར་གྱི་ཁྱམས་རིན་པོ་ཆེ་བཀོད་པར་ཕྱིན་ཏེ
en: They too hastened in an instant, that very moment, to the pavilion Jeweled Array.

source: དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་སྟན་རབ་ཏུ་བརྟན་པ་དག་ལ་འཁོད་དོ། །
en: They too prostrated at the Blessed One’s feet and took their seats.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་འདུས་པ་ཆེན་པོ་དེ་འདུས་པར་མཁྱེན་ནས་སྨིན་མཚམས་ཀྱི་མཛོད་སྤུ་ནས་བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་ཉེ་བར་སྟོན་པ་ཞེས་བྱ་བའི་འོད་ཟེར་ཕྱུང་སྟེ།
en: Then, when the Blessed One had comprehended that this large retinue had assembled, a light called display of the strength of bodhisattvas sprang from his forehead.

source: དེས་ཐམས་ཅད་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ལ་ལན་བདུན་བསྐོར་བ་བྱས་ནས། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དེ་ཉིད་ཀྱི་སྤྱི་བོར་མི་སྣང་བར་གྱུར་ཏོ། །
en: That light swirled around the whole group of bodhisattvas seven times and disappeared into the crowns of their heads.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མེ་ཏོག་དཔལ་གྱི་སྙིང་པོ་ཆོས་ཐམས་ཅད་ལ་དབང་སྒྱུར་བ་འོད་དེས་རེག་མ་ཐག་ཏུ། དེའི་ཚེ་སངས་རྒྱས་ཀྱི་མཐུས་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་རྒྱན་ཐམས་ཅད་བཀོད་པ་ཞེས་བྱ་བ་ལ་སྙོམས་པར་ཞུགས་སོ། །
en: Then, as soon as the light had touched the bodhisattva Puṣpaśrī­garbha­sarva­dharma­vaśavartin, by the power of the Buddha he attained the bodhisattva absorption called array of all ornaments.

source: བྱང་ཆུབ་སེམས་དཔའ་མེ་ཏོག་དཔལ་གྱི་སྙིང་པོ་ཆོས་ཐམས་ཅད་ལ་དབང་སྒྱུར་བ་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་རྒྱན་ཐམས་ཅད་བཀོད་པ་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ།
en: As soon as he had entered that absorption, a beautiful throne for the Blessed One appeared in the center of the pavilion Jeweled Array.

source: དེ་ནས་དེའི་ཚེ་འཁོར་གྱི་ཁྱམས་རིན་པོ་ཆེ་བཀོད་པའི་དབུས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་གདན་སེང་གེའི་ཁྲི་འཕང་དུ་ཤིང་ཏ་ལ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་ཙམ་དུ་མཐོ་བ། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་སྤྲས་པ། ཁ་ཁྱེར་རྒྱན་ཐམས་ཅད་ལས་བྱས་པ།
en: It was a raised lion throne the height of a gigantic palmyra tree. It rested on different types of embellished supports and was decorated with all kinds of precious things.

source: རས་བཀོད་པ་ཐམས་ཅད་བཏིང་བ། མེ་ཏོག་སིལ་མ་སྣ་ཚོགས་ཐམས་ཅད་བཀྲམ་པ།
en: It was draped in various types of cotton cloth and sprinkled with a variety of flower petals.

source: བླ་རེ་ཡིད་དུ་འོང་བ་ཐམས་ཅད་བྲེས་པ། བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཐམས་ཅད་ཀྱིས་ཡང་དག་པར་བཟུང་བ། འཁོར་ཐམས་ཅད་ཀྱི་མིག་གིས་བལྟས་པ།
en: The bodhisattvas held up an incredibly attractive parasol above the seat, and the seat was visible to the entire assembly.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སྟོན་པ། བསམ་པ་ཚིམ་པར་བྱེད་པ་ཞིག་བྱུང་བར་གྱུར་ཏོ།
en: It delighted and deeply gratified all sentient beings.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མེ་ཏོག་དཔལ་གྱི་སྙིང་པོ་ཆོས་ཐམས་ཅད་ལ་དབང་སྒྱུར་བས་དེ་བཞིན་གཤེགས་པའི་གདན་སེང་གེའི་ཁྲི་ཆེན་པོ་བསྐུལ་བར་བསྔགས་པ་མཐའ་ཡས་ཞེས་བྱ་བ་མངོན་པར་སྤྲུལ་ནས་དྲན་པ་དང་ལྡན་ཞིང་ཤེས་བཞིན་དུ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ཏེ
en: After the bodhisattva Puṣpaśrī­garbha­sarva­dharma­vaśavartin had conjured up the tathāgata seat, the great lion throne called limitless inspiring praise, he mindfully and deliberately emerged from that absorption.

source: གུས་པ་དང་བཅས་ཤིང་ཞེ་ས་དང་བཅས་པར་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: He spoke to the Blessed One, his palms joined in reverence, and said the following:

source: ཉི་མའི་འོད་ཀྱིས་འགྲོ་བའི་དགོས་པ་རབ་ཏུ་བགྱིད། །
en: “Sunlight sustains the needs of sentient beings.

source: ལྷ་དབང་གཟི་བརྗིད་ཡོན་ཏན་སུམ་ཅུ་རྩ་གསུམ་དགའ། །
en: The radiant qualities of Indra delight the gods of Trāyastriṃśa.

source: ཚངས་པའི་དབྱངས་ཀྱིས་ཚངས་པའི་འཇིག་རྟེན་རྣམ་པར་མཛེས། །
en: The voice of Brahmā embellishes the realm of Brahmā.

source: སངས་རྒྱས་མཐུ་ཡི་ཡུལ་གྱིས་རྣམ་པར་འཕྲུལ་པ་འདི། །
en: The domain of the Buddha’s power brings forth this manifestation.

source: ཆོས་རྣམས་མི་གཡོ་ནམ་མཁའི་རང་བཞིན་ཡ་མ་བརླ། །
en: “Phenomena are immovable, space-like and void,

source: སྒྱུ་མ་སྨིག་རྒྱུ་ལྟ་བུ་ཆུ་ཡི་ཟླ་འདྲ་ཞིང་། །
en: Illusory like a mirage and the reflection of the moon in water,

source: རྗེ་མེད་བྱེད་པ་པོ་དང་ཚོར་བ་པོ་མེད་པར། །
en: And without a master, creator, or agent of experience.

source: མཁྱེན་ནས་མགོན་པོ་འདིར་ནི་རྣམ་པར་སྒྲུབ་པ་སྟོན། །
en: Knowing this, the Protector displayed his accomplishment in this world.

source: བཀོད་པའི་སེམས་ཀྱི་དབང་འགྲོ་སེམས་ནི་གཟུགས་ཅན་མིན། །
en: “The mind with its powers of creation is itself formless.

source: རྣམ་སྒྲུབ་ཐམས་ཅད་སེམས་ཀྱི་རང་བཞིན་དབང་དུ་འགྲོ། །
en: All accomplishments are subject to the nature of the mind.

source: བཀོད་པ་ཐམས་ཅད་འདིར་ནི་སྒྱུ་མའི་རང་བཞིན་འདྲ། །
en: Everything that is created in this world resembles an illusion.

source: རྣམ་སྒྲུབ་བདག་གིས་མ་མཆིས་གང་ནའང་གནས་མ་མཆིས། །
en: These accomplishments are not my own and do not exist anywhere.

source: གང་གིས་སེམས་རྒྱུན་མ་མཆིས་རང་བཞིན་དག་འཚལ་བ། །
en: “For the one who knows the pure nature of the mind that has ceased

source: དེ་ལ་གློ་བུར་གནས་པའི་ཉོན་མོངས་མ་མཆིས་སོ། །
en: There are no adventitious afflictive emotions.

source: རྟོག་དང་ཀུན་རྟོག་ཡོངས་སུ་རྟོག་ལས་སེམས་གྲོལ་བ། །
en: A mind free of discursive thought, concepts, and discriminations

source: དེ་ནི་སྒྱུ་མའི་རྣམ་པར་སྤྲུལ་པ་སྣ་ཚོགས་སྟོན། །
en: Displays different illusory manifestations.

source: ས་སྟེང་རྡུལ་ཙམ་མངོན་པར་འཕགས་པ་མ་མཆིས་ཀྱང་། །
en: “In this place where no dust rises from the ground

source: ས་སྟེང་ནོར་བུ་རིན་ཆེན་སྣ་ཚོགས་ཀུན་ཏུ་བསྟན། །
en: And different types of jewels are displayed,

source: གདན་གང་བཞུགས་ནས་སེམས་ཅན་བྱེ་བ་འདུལ་འགྱུར་བ། །
en: Seated upon which you will tame millions of beings.

source: ཁྱོད་ཀྱི་སེང་གེའི་ཁྲི་གདན་རབ་མཛེས་བདག་གིས་བགྱིས། །
en: I made you a beautiful lion throne,

source: གདུགས་དང་རྒྱལ་མཚན་མཆོག་དང་དར་གྱི་ཕྲེང་བ་བསྒྲེང་། །
en: “I hoisted parasols, victory banners, and tassels made of silk

source: དེ་ནི་གང་དུའང་འགྲོ་བ་མ་མཆིས་འོང་མ་མཆིས། །
en: That neither come from nor go anywhere.

source: ཁྱོད་ཀྱིས་གང་ནས་ཆོས་རྣམས་འདུ་བ་མཁྱེན་ནས་ཀྱང་། །
en: While knowing whence phenomena come together,

source: སེམས་ཅན་དམ་པ་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་སྟོན། །
en: You display the different manifestations of a noble being.

source: ཚངས་པའི་དབྱངས་ལྡན་ལེགས་ཤིང་ཤིན་ཏུ་བསྲུངས་པའི་གསུང་། །
en: “Possessing the voice of Brahmā, your words are fine and reassuring.

source: འཇིག་རྟེན་སྒྲོན་མ་མཛད་པ་བསོད་ནམས་གཟི་བརྗིད་མང་། །
en: Since you are the lamp of the world, your deeds are filled with the brilliance of merit.

source: བདག་ལ་ཐུགས་བརྩེའི་སླད་དུ་འཛེགས་ཏེ་གདན་ལ་བཞུགས། །
en: Ascend the throne and be seated there, out of compassion for me.

source: རྒ་དང་འཆི་དང་ན་བ་གཅོད་པའི་ཆོས་བཤད་གསོལ། །
en: Please teach the Dharma that severs old age, sickness, and death.

source: ཁྱོད་ལ་བསྙེན་བཀུར་བགྱི་དང་ཆོས་ནི་མཉན་སླད་དུ། །
en: In order to pay homage to you and hear the Dharma.

source: རྣམ་དག་སེམས་ཅན་འདི་རྣམས་ཕྱོགས་བཅུ་དག་ནས་ལྷགས། །
en: “These pure beings have come together from all quarters

source: གང་གི་དོན་དུ་ལྷགས་པའི་དོན་དེ་སྩལ་དུ་གསོལ། །
en: Please fulfil the aspirations for which they have come,

source: སེང་གེའི་ཁྲི་ལ་བཞུགས་ཏེ་ཆོས་ཀྱང་བཤད་དུ་གསོལ། །
en: And explain the Dharma while seated on this lion throne.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་མེ་ཏོག་དཔལ་གྱི་སྙིང་པོ་ཆོས་ཐམས་ཅད་ལ་དབང་སྒྱུར་བའི་ལྷག་པའི་བསམ་པ་མཁྱེན་ནས་གདན་སེང་གེའི་ཁྲི་དེ་ལ་བཞུགས་སོ། །
en: Recognizing the determination of the bodhisattva Puṣpaśrī­garbha­sarva­dharma­vaśavartin, the Blessed One took his seat on the lion throne.

source: དེ་ནས་བཅོམ་ལྡན་འདས་སྒྲིབ་པ་མེད་པའི་རྣམ་པར་ཐར་པ་བརྙེས་ནས།
en: The Blessed One, who had attained unobstructed liberation, thus sat on the lion throne to teach the Dharma discourse The Gateway to Unobstructed Deliverance through the Bodhisattva Way of Life.
